"""
 Создать класс, описывающий группу студентов - `Group`. Данный класс хранит студентов в виде списка объектов
 `Student` также реализованного в виде соответствующего класса.
В классах реализовать необходимый набор атрибутов (Например класс `Student` должен иметь атрибуты `name`, `age`,
`grades`), а так же необходимый набор методов экземпляра для работы с этими экземплярами.

Задание напоминает ТУДУ лист))
Методы студента и группы придумать любые (штуки по 4-5) в классах.
К примеру:
    - студент может покинуть группу
    - перейти в другую
"""

class Group:
    def __init__(self):
        pass